tutorials/multiphase/reactingMultiphaseEulerFoam/RAS/wallBoiling1D_2phase/0.orig/alphat.liquid
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat.liquid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 1e-8;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 1e-8;
    }

    outlet
    {
        type            calculated;
        value           uniform 1e-8;
    }

    wall1
    {
        type            compressible::alphatWallBoilingWallFunction;
        otherPhase      gas;
        phaseType       liquid;
        Prt             0.85;
        relax           0.01;
        dmdt            uniform 0;
        partitioningModel
        {
            type        phaseFraction;//Lavieville;
            alphaCrit   0.2;
        }
        nucleationSiteModel
        {
            type        LemmertChawla;
        }
        departureDiamModel
        {
            type        TolubinskiKostanchuk;
        }
        departureFreqModel
        {
            type        Cole;
        }
        value           uniform 0.01;
    }

    wall2
    {
        type            compressible::alphatWallBoilingWallFunction;
        otherPhase      gas;
        phaseType       liquid;
        Prt             0.85;
        relax           0.01;
        dmdt            uniform 0;
        partitioningModel
        {
            type        phaseFraction;//Lavieville;
            alphaCrit   0.2;
        }
        nucleationSiteModel
        {
            type        LemmertChawla;
        }
        departureDiamModel
        {
            type        TolubinskiKostanchuk;
        }
        departureFreqModel
        {
            type        Cole;
        }
        value           uniform 0.01;
    }

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
